load-test.yml
# Artillery Load Test Configuration
config:
  target: "ws://localhost:8082"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 120
      arrivalRate: 10
      name: "Sustained load"

scenarios:
  - name: "Chat WebSocket Test"
    engine: ws
    flow:
      - connect:
          url: "/"
      - think: 1
      - send:
          payload: |
            {
              "user": {
                "id": "{{ $randomString() }}",
                "name": "User{{ $randomNumber(1, 100) }}",
                "avatar": "https://api.dicebear.com/7.x/avatars/svg?seed=test"
              },
              "message": "Test message {{ $randomNumber(1, 1000) }}",
              "timestamp": "{{ $timestamp }}"
            }
      - think: 5
      - send:
          payload: |
            {
              "user": {
                "id": "{{ $randomString() }}",
                "name": "User{{ $randomNumber(1, 100) }}",
                "avatar": "https://api.dicebear.com/7.x/avatars/svg?seed=test"
              },
              "message": "Another message {{ $randomNumber(1, 1000) }}",
              "timestamp": "{{ $timestamp }}"
            }
      - think: 10